# StructuralConnectionCannotGenerate Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StructuralConnectionFailures..::..StructuralConnectionCannotGenerate Property
BuiltInFailures..::..StructuralConnectionFailures Class See Also
---
Could not create Structural Connection Handler
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructuralConnectionCannotGenerate { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralConnectionCannotGenerate As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructuralConnectionCannotGenerate {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace